#include <stdio.h>
#include <conio.h>
#include <Windows.h>

//函数声明区
void creat_maze();
void role_move(char key);
void game_begin();

//全局变量区
int x = 68, y = 23;//用于表示人物的坐标
char qiangti[25][75] = {  "   ***********************************************************************",
						  "/--                   *                           *                      *",
						  "\\--                   *                           *                      *",
						  "   *                                              *                      *",
						  "   *    *****************************    ****************************    *",
						  "   *                  *                           *                      *",
						  "   *                  *                           *                      *",
						  "   *                  *                           *                      *",
						  "   *                  *                                                  *",
						  "   **********************************    *********************************",
						  "   *                                              *                      *",
						  "   *                  *                           *                      *",
						  "   *                  *                           *                      *",
						  "   *                                              *                      *",
						  "   *    *************************************************************    *",
						  "   *                  *                                                  *",
						  "   *                  *                           *                      *",
						  "   *                  *                           *                      *",
						  "   *                  *                                                  *",
						  "   *    *****************************    ****************************    *",
						  "   *                                              *                      *",
						  "   *                  *                           *                      *",
						  "   *                  *                           *                      *",
						  "   *                  *                           *                      *",
						  "   ******************************************************************" };


//主函数
void main()
{
	game_begin();
	creat_maze();
	printf("\033[?25l\033[40;32m@");
	while (1)
	{
		
		char key = _getch();
		role_move(key);
		if ((y == 1 && x == 3) || (y == 2 && x == 3))
		{
			printf("\033[2J\033[40;31m                         *****GameClear*****        ");
			Sleep(1200);
			break;	
		}
		
	}
}


//函数定义区
void game_begin()
{
	printf("**************************************************************************\n");
	printf("欢迎进入迷宫游戏，通过键盘W、S、A、D键来控制人物上下左右移动，最终逃离迷宫\n");
	printf("按任意键进入游戏\n");
	printf("**************************************************************************\n");
	system("pause\n");
	printf("\033[2J");
}

void role_move(char key)
{
	switch (key)
	{
	case 'd':
		if (qiangti[y][x + 1] == ' ')
		{		
			printf("\b @");
			x++;
		}
		break;
	case 'a':
		if (qiangti[y][x - 1] == ' ')
		{
			printf("\b\b@ \b");
			x--;
		}
		break;
	case 's':
		if (qiangti[y + 1 ][x] == ' ')
		{
			printf("\b \033[1B\b");
			printf("@");
			y++;
		}
		break;
	case 'w':
		if (qiangti[y - 1][x] == ' ')
		{
			printf("\b \033[1A\b");
			printf("@");
			y--;
		}
		break;
	}
}

void creat_maze()
{
	char* p[25] = {NULL};
	for (int i = 0; i < 25; i++)
	{   
		p[i] = qiangti[i];
		printf("%s", p[i]);
		if (i < 24)
		{
			printf("\n");
		}	
	}
	printf("\033[1A\b");
}


