#include <stdio.h>
int main()
{
	int i = 0, q;
	char m, a[9999], n;
	while (i >= 0 && i <= 119)
	{
		a[i] = '*'; i++;
	}
	for (i = 120; i <= 239; i++)
	{
		a[i] = ' ';
	}
	for (i = 240; i <= 359; i++)
	{
		a[i] = '*';
	}
	for (i = 360; i <= 479; i++)
	{
		a[i] = ' ';
	}
	for (i = 480; i <= 599; i++)
	{
		a[i] = '*';
	}
	for (i = 600; i <= 719; i++)
	{
		a[i] = ' ';
	}
	for (i = 720; i <= 839; i++)
	{
		a[i] = '*';
	}
	for (i = 840; i <= 959; i++)
	{
		a[i] = ' ';
	}
	for (i = 960; i <= 1079; i++)
	{
		a[i] = '*';
	}
	for (i = 1080; i <= 1199; i++)
	{
		a[i] = ' ';
	}
	for (i = 1200; i <= 1319; i++)
	{
		a[i] = '*';
	}
	for (i = 1320; i <= 1439; i++)
	{
		a[i] = ' ';
	}
	for (i = 1440; i <= 1559; i++)
	{
		a[i] = '*';
	}
	for (i = 1560; i <= 1679; i++)
	{
		a[i] = ' ';
	}
	for (i = 1680; i <= 1799; i++)
	{
		a[i] = '*';
	}
	for (i = 1800; i <= 1919; i++)
	{
		a[i] = ' ';
	}
	for (i = 1920; i <= 2039; i++)
	{
		a[i] = '*';
	}
	a[0] = 'O';
	a[1870] = 'P';
	a[251] = ' ';
	a[730] = ' ';
	a[830] = ' ';
	a[1060] = ' ';
	a[1211] = ' ';
	a[1250] = ' ';
	a[1500] = ' ';
	a[1690] = ' ';
	a[1780] = ' ';
	a[487] = ' ';
	a[1120] = '*';
	a[220] = '*';
	a[430] = '*';
	a[660] = '*';
	a[1600] = '*';
	q = 1870;
		do {
			printf("w-向上移动\ns-向下移动\na-向左移动\nd-向右移动\n先按方向键再按enter移动\n");
			for (i = 0; i <= 2039; i++) {
				printf("%c", a[i]);
			}
			m = getchar();
			n = getchar();
			switch (m)
			{
			case 119:
			{
				if (a[q - 120] != '*')
				{
					a[q] = ' ';
					q = q - 120;
					a[q] = 'P';
				}
			}
			break;
			case 115:
			{
				if (a[q + 120] != '*' )
				{
					a[q] = ' ';
					q = q + 120;
					a[q] = 'P';
				}
			}
			break;
			case 97:
			{
				if (a[q - 1] != '*' )
				{
					a[q] = ' ';
					q = q - 1;
					a[q] = 'P';
				}
			}
			break;
			case 100:
			{
				if (a[q + 1] != '*')
				{
					a[q] = ' ';
					q = q + 1;
					a[q] = 'P';
				}
			}
			break;
			default: break;
			}
			system("cls");
		} while (a[0] != 'P');
	return 0;
}